In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

# Series

In [3]:
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [4]:
#印出資料值
print('資料值 :', sample_pandas_data.values)
#印出索引值
print('索引值 :', sample_pandas_data.index)

資料值 : [ 0 10 20 30 40 50 60 70 80 90]
索引值 : RangeIndex(start=0, stop=10, step=1)

# Specify index in Series

In [5]:
sample_pandas_index_data = pd.Series(
    [0, 10,20,30,40,50,60,70,80,90],
    #輸入自訂的文字index
    index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    
)

print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [6]:
print('資料值:', sample_pandas_index_data.values)
print('索引值:', sample_pandas_index_data.index)

資料值: [ 0 10 20 30 40 50 60 70 80 90]
索引值: Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

# DataFrame

In [7]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}

attri_data_frame1 = DataFrame(attri_data1)

print(attri_data_frame1)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve

# Specify Index in DataFrame

In [8]:
attri_data_frame_index1 = DataFrame(attri_data1,
                                    #輸入自訂的index
                                    index=['a', 'b', 'c', 'd', 'e']
                                   )
print(attri_data_frame_index1)

    ID       City  Birth_year    Name
a  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
c  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
e  104  Kaohsiung        1982   Steve

In [9]:
attri_data_frame_index1#在numpy可用此方法輸出

    ID       City  Birth_year    Name
a  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
c  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
e  104  Kaohsiung        1982   Steve

# Transpose

In [10]:
#attri_data_frame1的行列交換
attri_data_frame1.T#可讓dataframe的行列交換

                 0       1        2       3          4
ID             100     101      102     103        104
City        Taipei  Taipei  Hsinchu  Tainan  Kaohsiung
Birth_year    1990    1989     1992    1997       1982
Name         Sally   Hanks   Hannah   Kitty      Steve

# Get One Column

In [11]:
#取得Birth_year行
attri_data_frame1.Birth_year#可只輸出其中幾行

0    1990
1    1989
2    1992
3    1997
4    1982
Name: Birth_year, dtype: int64

# Get Many Column

In [12]:
#取得ID與Birth_year行
attri_data_frame1[['ID', 'Birth_year']]#可輸出其中幾行

    ID  Birth_year
0  100        1990
1  101        1989
2  102        1992
3  103        1997
4  104        1982

# Filter

In [13]:
# attri_data_frame1中找出City為Taipei的資料
attri_data_frame1[attri_data_frame1['City'] == 'Taipei']#只取滿足特定條件的資料(即輸出true的資料)

    ID    City  Birth_year   Name
0  100  Taipei        1990  Sally
1  101  Taipei        1989  Hanks

In [14]:
attri_data_frame1['City'] == 'Taipei'#顯示true/false

0     True
1     True
2    False
3    False
4    False
Name: City, dtype: bool

# Filter for Many Requiements

In [15]:
#attri_data_frame1中找出City為台北和台南的資料
attri_data_frame1[attri_data_frame1['City'].isin(['Taipei', 'Tainan'])]#需要指定多個條件的用法

    ID    City  Birth_year   Name
0  100  Taipei        1990  Sally
1  101  Taipei        1989  Hanks
3  103  Tainan        1997  Kitty

# Pratice

In [16]:
#找出attri_data_frame1的Birth_year小於1990
attri_data_frame1[attri_data_frame1['Birth_year'] < 1990]

    ID       City  Birth_year   Name
1  101     Taipei        1989  Hanks
4  104  Kaohsiung        1982  Steve

# Drop Column

In [17]:
#去掉Birth_year這一行
attri_data_frame1.drop(['Birth_year'], axis = 1)#axis = 1刪除行(沒有assign並沒有真正的刪除)

    ID       City    Name
0  100     Taipei   Sally
1  101     Taipei   Hanks
2  102    Hsinchu  Hannah
3  103     Tainan   Kitty
4  104  Kaohsiung   Steve

In [18]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}


attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)

attri_data_frame1.drop(['Birth_year'], axis = 1)
print(attri_data_frame1)

#使用assign，使得attri_data_frame1的資料中真正拿掉Birth_year行
attri_data_frame1 = attri_data_frame1.drop(['Birth_year'], axis = 1)
print(attri_data_frame1)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID       City    Name
0  100     Taipei   Sally
1  101     Taipei   Hanks
2  102    Hsinchu  Hannah
3  103     Tainan   Kitty
4  104  Kaohsiung   Steve

# Combine DataFrame

In [19]:
#準備資料
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}
attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)


attri_data2 = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}
attri_data_frame2 = DataFrame(attri_data2)
print(attri_data_frame2)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [20]:
#合併資料
pd.merge(attri_data_frame1, attri_data_frame2)#只merge聯及的範圍

    ID     City  Birth_year    Name  Math  English Sex
0  100   Taipei        1990   Sally    50       90   M
1  101   Taipei        1989   Hanks    43       30   F
2  102  Hsinchu        1992  Hannah    33       20   F

# Statistics

In [21]:
#將「Sex」的行設為基準來計算出數學成績的平均分數
attri_data_frame2.groupby('Sex')['Math'].mean()#將math用sex分別,取mean

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

# Practice

In [22]:
#將「Sex」的行設為基準來計算出英文成績的最大值與最小值。
attri_data_frame2.groupby('Sex')['English'].max()

Sex
F    30
M    90
Name: English, dtype: int64

In [23]:
attri_data_frame2.groupby('Sex')['English'].min()

Sex
F    20
M    30
Name: English, dtype: int64

# Sort

In [24]:
#準備資料
attri_data2 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}
attri_data_frame_index2 = DataFrame(attri_data2,index=['e','b','a','d','c'])
attri_data_frame_index2

    ID       City  Birth_year    Name
e  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
a  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
c  104  Kaohsiung        1982   Steve

In [25]:
#sort by index
attri_data_frame_index2.sort_index()

    ID       City  Birth_year    Name
a  102    Hsinchu        1992  Hannah
b  101     Taipei        1989   Hanks
c  104  Kaohsiung        1982   Steve
d  103     Tainan        1997   Kitty
e  100     Taipei        1990   Sally

In [26]:
#sort by values
attri_data_frame_index2.Birth_year.sort_values()#必須指定是用哪個value

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: int64

# Check nan

In [27]:
#確認是否存在該值
attri_data_frame_index2.isin(['Taipei'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False   True       False  False
a  False  False       False  False
d  False  False       False  False
c  False  False       False  False

In [28]:
# 處理遺漏值
# 將Name設成nan
import numpy as np
attri_data_frame_index2['Name'] = np.nan

#判斷是否為nan
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [29]:
#計算nan的總數
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

# Practice 1

In [30]:
from pandas import Series,DataFrame
import pandas as pd

attri_data1 = {'ID':['1','2','3','4','5'],
               'Sex':['F','F','M','M','F'],
               'Money':[1000,2000,500,300,700],
               'Name':['Alice','Bob','Candy','David','Ella']}

attri_data_frame1 = DataFrame

In [31]:
attri_data2 = {'ID':['3','4','7'],
               'Math':[60,30,40],
               'English':[80,20,30]}

attri_data_frame2 = DataFrame(attri_data2)